; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star0 - direction
	Star2 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 123)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 125)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star0)
	(supports instrument4 image0)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 111)
	(= (data Planet4 image0) 157)
	(= (data Star5 image0) 197)
	(= (data Planet6 image0) 174)
	(= (data Planet7 image0) 188)
	(= (data Planet8 image0) 155)
	(= (data Planet4 thermograph1) 283)
	(= (data Star5 thermograph1) 152)
	(= (data Planet6 thermograph1) 72)
	(= (data Planet7 thermograph1) 83)
	(= (data Planet8 thermograph1) 242)
	(= (data Planet4 spectrograph2) 233)
	(= (data Star5 spectrograph2) 183)
	(= (data Planet6 spectrograph2) 273)
	(= (data Planet7 spectrograph2) 88)
	(= (data Planet8 spectrograph2) 282)
	(= (slew_time GroundStation1 Star0) 50.46)
	(= (slew_time Star0 GroundStation1) 50.46)
	(= (slew_time GroundStation3 Star0) 5.106)
	(= (slew_time Star0 GroundStation3) 5.106)
	(= (slew_time GroundStation3 GroundStation1) 72.51)
	(= (slew_time GroundStation1 GroundStation3) 72.51)
	(= (slew_time GroundStation3 Star2) 57.22)
	(= (slew_time Star2 GroundStation3) 57.22)
	(= (slew_time Star2 Star0) 56.96)
	(= (slew_time Star0 Star2) 56.96)
	(= (slew_time Star2 GroundStation1) 47.14)
	(= (slew_time GroundStation1 Star2) 47.14)
	(= (slew_time Planet4 Star0) 36.59)
	(= (slew_time Star0 Planet4) 36.59)
	(= (slew_time Planet4 GroundStation1) 28.76)
	(= (slew_time GroundStation1 Planet4) 28.76)
	(= (slew_time Planet4 Star2) 49.38)
	(= (slew_time Star2 Planet4) 49.38)
	(= (slew_time Planet4 GroundStation3) 10.23)
	(= (slew_time GroundStation3 Planet4) 10.23)
	(= (slew_time Star5 Star0) 21.31)
	(= (slew_time Star0 Star5) 21.31)
	(= (slew_time Star5 GroundStation1) 44.45)
	(= (slew_time GroundStation1 Star5) 44.45)
	(= (slew_time Star5 Star2) 9.201)
	(= (slew_time Star2 Star5) 9.201)
	(= (slew_time Star5 GroundStation3) 27.95)
	(= (slew_time GroundStation3 Star5) 27.95)
	(= (slew_time Star5 Planet4) 42.66)
	(= (slew_time Planet4 Star5) 42.66)
	(= (slew_time Planet6 Star0) 47.01)
	(= (slew_time Star0 Planet6) 47.01)
	(= (slew_time Planet6 GroundStation1) 34.9)
	(= (slew_time GroundStation1 Planet6) 34.9)
	(= (slew_time Planet6 Star2) 36.6)
	(= (slew_time Star2 Planet6) 36.6)
	(= (slew_time Planet6 GroundStation3) 62.79)
	(= (slew_time GroundStation3 Planet6) 62.79)
	(= (slew_time Planet6 Planet4) 21.01)
	(= (slew_time Planet4 Planet6) 21.01)
	(= (slew_time Planet6 Star5) 25.18)
	(= (slew_time Star5 Planet6) 25.18)
	(= (slew_time Planet7 Star0) 44.2)
	(= (slew_time Star0 Planet7) 44.2)
	(= (slew_time Planet7 GroundStation1) 3.188)
	(= (slew_time GroundStation1 Planet7) 3.188)
	(= (slew_time Planet7 Star2) 16.16)
	(= (slew_time Star2 Planet7) 16.16)
	(= (slew_time Planet7 GroundStation3) 2.036)
	(= (slew_time GroundStation3 Planet7) 2.036)
	(= (slew_time Planet7 Planet4) 69.22)
	(= (slew_time Planet4 Planet7) 69.22)
	(= (slew_time Planet7 Star5) 8.584)
	(= (slew_time Star5 Planet7) 8.584)
	(= (slew_time Planet7 Planet6) 29.91)
	(= (slew_time Planet6 Planet7) 29.91)
	(= (slew_time Planet8 Star0) 12.87)
	(= (slew_time Star0 Planet8) 12.87)
	(= (slew_time Planet8 GroundStation1) 57.6)
	(= (slew_time GroundStation1 Planet8) 57.6)
	(= (slew_time Planet8 Star2) 48.59)
	(= (slew_time Star2 Planet8) 48.59)
	(= (slew_time Planet8 GroundStation3) 9.695)
	(= (slew_time GroundStation3 Planet8) 9.695)
	(= (slew_time Planet8 Planet4) 33.4)
	(= (slew_time Planet4 Planet8) 33.4)
	(= (slew_time Planet8 Star5) 70.36)
	(= (slew_time Star5 Planet8) 70.36)
	(= (slew_time Planet8 Planet6) 30.99)
	(= (slew_time Planet6 Planet8) 30.99)
	(= (slew_time Planet8 Planet7) 21.76)
	(= (slew_time Planet7 Planet8) 21.76)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet4 image0)
	(have_image Star5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Planet7 thermograph1)
	(have_image Planet8 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation3 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 123 to 120.964, (fuel-used) from 0 to 2.036
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 planet4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 120.964 to 110.734, (fuel-used) from 2.036 to 12.266
   goals met: 0 of 5
5. (take_image satellite0 planet4 instrument0 image0)
   added: (have_image planet4 image0)
   changed: (data_capacity satellite0) from 1000 to 843, (data-stored) from 0 to 157
   goals met: 1 of 5
6. (turn_to satellite0 planet6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 110.734 to 89.724, (fuel-used) from 12.266 to 33.276
   goals met: 1 of 5
7. (turn_to satellite1 planet7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 125 to 108.84, (fuel-used) from 33.276 to 49.436
   goals met: 1 of 5
8. (turn_to satellite1 star5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 108.84 to 100.256, (fuel-used) from 49.436 to 58.02
   goals met: 1 of 5
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 5
10. (turn_to satellite1 groundstation3 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 100.256 to 72.306, (fuel-used) from 58.02 to 85.97
   goals met: 1 of 5
11. (turn_to satellite1 star5 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 72.306 to 44.356, (fuel-used) from 85.97 to 113.92
   goals met: 1 of 5
12. (take_image satellite0 planet6 instrument0 spectrograph2)
   added: (have_image planet6 spectrograph2)
   changed: (data_capacity satellite0) from 843 to 570, (data-stored) from 157 to 430
   goals met: 2 of 5
13. (turn_to satellite1 planet7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 44.356 to 35.772, (fuel-used) from 113.92 to 122.504
   goals met: 2 of 5
14. (turn_to satellite1 groundstation3 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 35.772 to 33.736, (fuel-used) from 122.504 to 124.54
   goals met: 2 of 5
15. (turn_to satellite1 planet7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 33.736 to 31.7, (fuel-used) from 124.54 to 126.576
   goals met: 2 of 5
16. (turn_to satellite1 groundstation3 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 31.7 to 29.664, (fuel-used) from 126.576 to 128.612
   goals met: 2 of 5
17. (turn_to satellite1 planet7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 29.664 to 27.628, (fuel-used) from 128.612 to 130.648
   goals met: 2 of 5
18. (turn_to satellite1 groundstation3 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 27.628 to 25.592, (fuel-used) from 130.648 to 132.684
   goals met: 2 of 5
19. (turn_to satellite1 star0 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 25.592 to 20.486, (fuel-used) from 132.684 to 137.79
   goals met: 2 of 5
20. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 2 of 5
21. (turn_to satellite1 groundstation3 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 20.486 to 15.38, (fuel-used) from 137.79 to 142.896
   goals met: 2 of 5
22. (turn_to satellite1 planet7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 15.38 to 13.344, (fuel-used) from 142.896 to 144.932
   goals met: 2 of 5
23. (take_image satellite1 planet7 instrument2 thermograph1)
   added: (have_image planet7 thermograph1)
   changed: (data_capacity satellite1) from 1000 to 917, (data-stored) from 430 to 513
   goals met: 3 of 5
24. (turn_to satellite1 groundstation3 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 13.344 to 11.308, (fuel-used) from 144.932 to 146.968
   goals met: 3 of 5
25. (turn_to satellite1 planet8 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 11.308 to 1.613, (fuel-used) from 146.968 to 156.663
   goals met: 3 of 5
26. (turn_to satellite0 star5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 89.724 to 64.544, (fuel-used) from 156.663 to 181.843
   goals met: 3 of 5
27. (take_image satellite0 star5 instrument0 spectrograph2)
   added: (have_image star5 spectrograph2)
   changed: (data_capacity satellite0) from 570 to 387, (data-stored) from 513 to 696
   goals met: 4 of 5
28. (take_image satellite1 planet8 instrument2 thermograph1)
   added: (have_image planet8 thermograph1)
   changed: (data_capacity satellite1) from 917 to 675, (data-stored) from 696 to 938
   goals met: 5 of 5
